# Log 1

## 1. 今日核心目标
这两天主要是用ai做一个简单的项目游戏：Schulte Grid，这个项目适合html/css/js三件套，（但是基于没学过这个语言，
要想完全读懂代码以及框架必须按需学习）。

## 2. 实际完成情况
今天完成了页面跳转和方格生成。

## 3. AI参与情况
使用ai生成基础的页面骨架，（我在这三个文件仿写了一段以便于理解含义，剩下的重复的改了两个发现这种工作ai做更好，所以就ai生成）
ai讲解代码、运行结构、编写大致的逻辑以及习惯，（可以说是个劳模了Orz）
我做了大致的预期模型（手写）、理解代码，找到整体逻辑，以及发现问题（解决的方法仍然需要ai协助，ai的确是个牢劳模！）

## 4. 技术/认知收获
能看懂大致的html等等代码，还算了解了html开发的逻辑，解决一丁点小bug（像同类型盒子首选覆盖这种小问题）
说实话，我感觉我只是ai老师傅的一个小学徒，但是实际上我应该把他当作我的工具才对，就像字典一样，这对我动态学习有帮助

## 5. 实验 / 项目进展
当前状态：完成了单页面界面跳转，完成了[开始页]->[预设]->[游戏页]、[开始页]->[排行页]的跳转逻辑，
游戏页处理了方格生成，随机数并绑定方格作为性质。
当前已经完成UI状态流转和基础数据生成，但还未进入核心交互逻辑。

## 6. 问题 / 卡点
在 AI 协作方面发现一些小问题：
1.在小型项目中，与AI交流的复制粘贴存在很大的限制和延迟，这使得超过一定字数的代码要等半天，甚至直接崩溃。
后续应当设法解决这个问题，采取别的措施，比如做简化大致逻辑的伪代码、接入API等等，不过要先了解造成卡顿的实际原因才行
其他问题：
1.好像经常出现汉字损坏现象，之后得了解原理，看看有没有一劳永逸的方法

## 7. 明日推进方向
明天完成一下具体的逻辑实现，稍微改改公式化的要死的UI界面，应该就差不多了
